In [1]:
!pip install ipython-sql
!pip install sqlalchemy
!pip install psycopg2

Requirement already satisfied: ipython-sql in c:\users\uwizeyimana\anaconda3\lib\site-packages (0.4.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable<1 in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: ipython>=1.0 in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython-sql) (7.16.1)
Requirement already satisfied: six in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: sqlparse in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython-sql) (0.3.1)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython-sql) (1.3.18)
Requirement already satisfied: jedi>=0.10 in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.17.1)
Requirement already satisfied: setuptools>=18.5 in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (49.2.0.post20200714)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.5)
Requirement already satisfied: pickleshare in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: decorator in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: traitlets>=4.2 in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.3.3)
Requirement already satisfied: backcall in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: colorama; sys_platform == "win32" in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.3)
Requirement already satisfied: pygments in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.6.1)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\users\uwizeyimana\anaconda3\lib\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in c:\users\uwizeyimana\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: sqlalchemy in c:\users\uwizeyimana\anaconda3\lib\site-packages (1.3.18)
Requirement already satisfied: psycopg2 in c:\users\uwizeyimana\anaconda3\lib\site-packages (2.8.6)

In [2]:
%load_ext sql

In [3]:
from sqlalchemy import create_engine

In [5]:
%sql postgresql://postgres:Kinglord@localhost/moodle

In [4]:
engine = create_engine('postgresql://postgres:Kinglord@localhost/moodle')

In [6]:
%%sql
Select * From mdl_user Limit 5;

 * postgresql://postgres:***@localhost/moodle
5 rows affected.

[(1, 1, 0, 0, 0, '', 'Germany', 'en', 0, 0, 0, 0, '', 'Male', 'DE'),
 (20, 1, 0, 0, 0, '', 'Germany', 'en', 1549745767, 1562935333, 1549745767, 1562935333, '197.215.32.111', 'Male', 'DE'),
 (15, 1, 0, 0, 0, '', 'Germany', 'en', 1549633236, 1563537002, 1563469481, 1563537002, '41.184.239.200', 'Male', 'DE'),
 (36, 1, 0, 0, 0, '', 'Ghana', 'en', 1549641288, 1559227964, 1549651186, 1559227892, '154.160.1.224', 'Male', 'GH'),
 (44, 1, 0, 0, 0, '', 'Ghana', 'en', 1549637001, 1560095090, 1557475553, 1560094908, '129.122.1.14', 'Male', 'GH')]

# Task 1

1.1 Counting the number of tables in a database

In [9]:
%%sql
Select COUNT(*) FROM information_schema.tables

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(643,)]

We have 643 tables in our database but we will explore some which are the following:
mdl_logstore_standard_log,
mdl_context,
mdl_user,
mdl_course,
mdl_modules,
mdl_course_modules,
mdl_course_modules_completion.

1.2
counting records in each table.

In [14]:
#log store records
%%sql
SELECT COUNT(*) FROM mdl_logstore_standard_log

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(417554,)]

In [15]:
#context records
%%sql
SELECT COUNT(*) FROM mdl_context

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(4359,)]

In [16]:
#user recorded
%%sql
SELECT COUNT(*) FROM mdl_user

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(1052,)]

In [17]:
#courses recorded
%%sql
SELECT COUNT(*) FROM mdl_course

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(15,)]

In [18]:
#modules recorded
%%sql
SELECT COUNT(*) FROM mdl_modules

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(26,)]

In [20]:
#course module recorded
%%sql
SELECT COUNT(*) FROM mdl_course_modules

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(290,)]

In [21]:
#modules completed records
%%sql
SELECT COUNT(*) FROM mdl_course_modules_completion

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(4483,)]

In [28]:
%%sql
Select * From mdl_course_modules Limit 5;

 * postgresql://postgres:***@localhost/moodle
5 rows affected.

[(1, 1, 9, 1, 2, None, 1548435669, 0, 0, 1, 1, 1, 0, 0, 0, None, 0, 0, 0, None, 0),
 (23, 6, 12, 1, 17, None, 1206338932, 0, 0, 1, 1, 1, 0, 0, 0, None, 0, 0, 0, None, 0),
 (69, 8, 15, 2, 29, '', 1543620947, 0, 0, 1, 1, 1, 0, 0, 0, None, 0, 0, 0, None, 0),
 (24, 6, 9, 4, 17, None, 1206338989, 0, 0, 1, 1, 1, 1, 0, 0, None, 0, 0, 0, None, 0),
 (227, 11, 9, 24, 57, None, 1549462268, 0, 0, 1, 1, 1, 0, 0, 0, None, 0, 0, 0, None, 0)]

1.4 Monthly usage time of learners who have confirmed and are not deleted

In [35]:
%%sql
SELECT * FROM mdl_user
WHERE confirmed = '1' AND deleted = '0'
LIMIT 5

 * postgresql://postgres:***@localhost/moodle
5 rows affected.

[(1, 1, 0, 0, 0, '', 'Germany', 'en', 0, 0, 0, 0, '', 'Male', 'DE'),
 (20, 1, 0, 0, 0, '', 'Germany', 'en', 1549745767, 1562935333, 1549745767, 1562935333, '197.215.32.111', 'Male', 'DE'),
 (15, 1, 0, 0, 0, '', 'Germany', 'en', 1549633236, 1563537002, 1563469481, 1563537002, '41.184.239.200', 'Male', 'DE'),
 (36, 1, 0, 0, 0, '', 'Ghana', 'en', 1549641288, 1559227964, 1549651186, 1559227892, '154.160.1.224', 'Male', 'GH'),
 (44, 1, 0, 0, 0, '', 'Ghana', 'en', 1549637001, 1560095090, 1557475553, 1560094908, '129.122.1.14', 'Male', 'GH')]

1.5 Count of log events per user for the following verbs: ['loggedin', 'viewed', 'started', ,'submitted', 'uploaded', 'updated',
                                                       'searched', 'resumed', 'answered', 'attempted', 'abandoned']

In [36]:
%%sql
SELECT COUNT(*)
FROM mdl_logstore_standard_log
WHERE action = 'viewed'

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(120167,)]

In [37]:
%%sql
SELECT COUNT(*)
FROM mdl_logstore_standard_log
WHERE action = 'loggedin'

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(4444,)]

In [38]:
%%sql
SELECT COUNT(*)
FROM mdl_logstore_standard_log
WHERE action = 'started'

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(3679,)]

In [39]:
%%sql
SELECT COUNT(*)
FROM mdl_logstore_standard_log
WHERE action = 'submitted'

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(2288,)]

In [40]:
%%sql
SELECT COUNT(*)
FROM mdl_logstore_standard_log
WHERE action = 'uploaded'

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(173,)]

In [41]:
%%sql
SELECT COUNT(*)
FROM mdl_logstore_standard_log
WHERE action = 'searched'

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(14,)]

In [42]:
%%sql
SELECT COUNT(*)
FROM mdl_logstore_standard_log
WHERE action = 'resumed'

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(1422,)]

In [43]:
%%sql
SELECT COUNT(*)
FROM mdl_logstore_standard_log
WHERE action = 'answered'

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(362,)]

In [44]:
%%sql
SELECT COUNT(*)
FROM mdl_logstore_standard_log
WHERE action = 'attempted'

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(0,)]

In [45]:
%%sql
SELECT COUNT(*)
FROM mdl_logstore_standard_log
WHERE action = 'abandoned'

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(5,)]

Write a python class to pull 
Overall grade of learners for 
Number of forum posts